Step 1. Import the necessary libraries
Step 2. Import the dataset from this address.
https://github.com/guipsamora/pandas_exercises/blob/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv
Step 3. Assign it to a variable called df.

In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv')
df.head(1)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6

In [22]:
df.shape

(395, 33)

Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [5]:
df.columns

Index(['school', 'sex', 'age', 'address', 'famsize', 'Pstatus', 'Medu', 'Fedu',
       'Mjob', 'Fjob', 'reason', 'guardian', 'traveltime', 'studytime',
       'failures', 'schoolsup', 'famsup', 'paid', 'activities', 'nursery',
       'higher', 'internet', 'romantic', 'famrel', 'freetime', 'goout', 'Dalc',
       'Walc', 'health', 'absences', 'G1', 'G2', 'G3'],
      dtype='object')

In [32]:
df=df.loc[:,'school':'guardian'].head()
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father

Step 5. Create a lambda function that captalize strings.

In [49]:
cap=lambda x: x.capitalize()
cap('nandhu')

'Nandhu'

Step 6. Capitalize both Mjob and Fjob

In [50]:
df['Mjob']=df['Mjob'].str.upper()
df['Mjob'].unique()
df['Fjob']=df['Fjob'].apply(cap)
df['Fjob']
df['Mjob']=df['Mjob'].apply(cap)
df['Mjob'].unique()

array(['At_home', 'Health', 'Other'], dtype=object)

Step 7. Print the last elements of the data set.

In [51]:
df.tail

<bound method NDFrame.tail of   school sex  age address famsize Pstatus  Medu  Fedu     Mjob      Fjob  \
0     GP   F   18       U     GT3       A     4     4  At_home   Teacher
1     GP   F   17       U     GT3       T     1     1  At_home     Other
2     GP   F   15       U     LE3       T     1     1  At_home     Other
3     GP   F   15       U     GT3       T     4     2   Health  Services
4     GP   F   16       U     GT3       T     3     3    Other     Other

   reason guardian legal_drinker
0  course   mother          True
1  course   father         False
2   other   mother         False
3    home   mother         False
4    home   father         False  >

Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob

In [52]:
df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,course,mother,True
1,GP,F,17,U,GT3,T,1,1,At_home,Other,course,father,False
2,GP,F,15,U,LE3,T,1,1,At_home,Other,other,mother,False
3,GP,F,15,U,GT3,T,4,2,Health,Services,home,mother,False
4,GP,F,16,U,GT3,T,3,3,Other,Other,home,father,False

Step 9. Create a function called majority that return a boolean value to a new column called 
legal_drinker (Consider majority as older than 17 years old)

In [53]:
def majority(x):
    if x>17:
        return 'True'
    else:
        return 'False'
#majority(11)

In [54]:
df['legal_drinker']=df['age'].apply(majority)
df.head(2)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,course,mother,True
1,GP,F,17,U,GT3,T,1,1,At_home,Other,course,father,False

Step 10. Multiply every number of the dataset by 10.
I know this makes no sense, don't forget it is just an exercise¶

In [83]:
def multiply(x):
    if type(x)== int:
        return x*10
    else:
        return x
#multiply(nandhu)

In [84]:
df=df.applymap(multiply)
df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,1800,U,GT3,A,400,400,At_home,Teacher,course,mother,True
1,GP,F,1700,U,GT3,T,100,100,At_home,Other,course,father,False
2,GP,F,1500,U,LE3,T,100,100,At_home,Other,other,mother,False
3,GP,F,1500,U,GT3,T,400,200,Health,Services,home,mother,False
4,GP,F,1600,U,GT3,T,300,300,Other,Other,home,father,False